In [1]:
import pandas as pd

In [3]:
air_quality = pd.read_csv("air_quality_no2.csv", index_col=0, parse_dates=True)

In [4]:
air_quality.head()

                     station_antwerp  station_paris  station_london
datetime
2019-05-07 02:00:00              NaN            NaN            23.0
2019-05-07 03:00:00             50.5           25.0            19.0
2019-05-07 04:00:00             45.0           27.7            19.0
2019-05-07 05:00:00              NaN           50.4            16.0
2019-05-07 06:00:00              NaN           61.9             NaN

In [6]:
air_quality["london_mg_per_cubic"] = air_quality["station_london"]

In [7]:
air_quality.head()

,station_antwerp,station_paris,station_london,london_mg_per_cubic
datetime,,,,
2019-05-07 02:00:00,NaN,NaN,23.0,23.0
2019-05-07 03:00:00,50.5,25.0,19.0,19.0
2019-05-07 04:00:00,45.0,27.7,19.0,19.0
2019-05-07 05:00:00,NaN,50.4,16.0,16.0
2019-05-07 06:00:00,NaN,61.9,NaN,NaN

To create a new column that is already on the table use the name of the old column and the name of new column and using brackets add it to the graph. Very similar to regualr python coding.

In [8]:
air_quality["ratio_paris_antwerp"] = (
    air_quality["station_paris"] / air_quality["station_antwerp"]
)

In [9]:
air_quality.head()

,station_antwerp,station_paris,station_london,london_mg_per_cubic,ratio_paris_antwerp
datetime,,,,,
2019-05-07 02:00:00,NaN,NaN,23.0,23.0,NaN
2019-05-07 03:00:00,50.5,25.0,19.0,19.0,0.495050
2019-05-07 04:00:00,45.0,27.7,19.0,19.0,0.615556
2019-05-07 05:00:00,NaN,50.4,16.0,16.0,NaN
2019-05-07 06:00:00,NaN,61.9,NaN,NaN,NaN

## Star I want to change the names of the columns to the corresponding station identifers how do i do it?

In [11]:
air_quality_renamed = air_quality.rename(
    columns={
        "station_antwerp": "BETR801",
        "station_paris": "FR04014",
        "station_london": "London Westminster",
    }
)

In [12]:
air_quality_renamed.head()

,BETR801,FR04014,London Westminster,london_mg_per_cubic,ratio_paris_antwerp
datetime,,,,,
2019-05-07 02:00:00,NaN,NaN,23.0,23.0,NaN
2019-05-07 03:00:00,50.5,25.0,19.0,19.0,0.495050
2019-05-07 04:00:00,45.0,27.7,19.0,19.0,0.615556
2019-05-07 05:00:00,NaN,50.4,16.0,16.0,NaN
2019-05-07 06:00:00,NaN,61.9,NaN,NaN,NaN

In [13]:
air_quality_all = air_quality_renamed.rename(
    columns={
        "london_mg_per_cubic": "london_cubic",
        "ratio_paris_antwerp": "ratios"
    }
)

In [15]:
air_quality_all.head()

,BETR801,FR04014,London Westminster,london_cubic,ratios
datetime,,,,,
2019-05-07 02:00:00,NaN,NaN,23.0,23.0,NaN
2019-05-07 03:00:00,50.5,25.0,19.0,19.0,0.495050
2019-05-07 04:00:00,45.0,27.7,19.0,19.0,0.615556
2019-05-07 05:00:00,NaN,50.4,16.0,16.0,NaN
2019-05-07 06:00:00,NaN,61.9,NaN,NaN,NaN

Details about column or row label renaming is provided in the user guide section of the docs under renaming labels.

In [16]:
titanic = pd.read_csv("titanic.csv")

In [17]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [20]:
my_titanic = pd.read_csv("titanic.csv", index_col=0)

In [21]:
my_titanic.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

## Summary Stats

What is the average age of the titanic passengers?

In [22]:
titanic["Age"].mean()

29.69911764705882

You identify the column with the age title and the average is returned to you as nesscary.

This is going to be important Star what is the differnce between median and mean in math you are going back in time.